---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateLength
source: html/7d224e96-2685-654c-d521-29a22c1cd4bc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemPlateLength { get; }
```